# Combining Customer Data with Orders & Products Data

## Table of Contents

- Ex 3. Importing libraries and data
- Ex 4. Wrangling customers data
- Ex 5. Performing quality and consistency checks on customer data
- Ex 6. Merging customer with ords_prods data

### Ex 3. Importing libraries and data

3. Import your analysis libraries, as well as your new customer data set as a dataframe.

In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
# Create a project folder string

path = r'/Users/nora/Desktop/Instacart Basket Analysis'

In [3]:
# Import customers data set

df_customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [4]:
df_customers.shape

(206209, 10)

In [5]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

### Ex 4. Wrangling customers data

4. Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis.

In [6]:
# Checking for data types of columns

df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [7]:
# Rename Surnam column to Surname

df_customers.rename(columns = {'Surnam' : 'Surname'}, inplace = True)

# I am not deleting any columns since I don't know which columns I will need for the upcoming analysis yet

### Ex 5. Performing quality and consistency checks on customer data

5. Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

In [8]:
# Check for mixed-type columns

for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

First Name

In [9]:
# Fix the mixed-type column

df_customers['First Name'] = df_customers['First Name'].astype('str')

In [10]:
# Find missing values

df_customers.isnull().sum() # No missing values in the data set

user_id         0
First Name      0
Surname         0
Gender          0
STATE           0
Age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

In [11]:
# Look for full duplictates within your data frame

df_dups = df_customers[df_customers.duplicated()]

In [12]:
df_dups # No duplicates

Empty DataFrame
Columns: [user_id, First Name, Surname, Gender, STATE, Age, date_joined, n_dependants, fam_status, income]
Index: []

### Ex 6. Merging customer with ords_prods data

6. Combine your customer data with the rest of your prepared Instacart data. Tip: Make sure the key columns are of the same data type!

In [13]:
# Import the latest data set

ords_prods = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'data_with_flags.pkl'))

In [14]:
ords_prods.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,...,busiest day,Busiest days,time_period,busiest_period_of_day,max_order,loyalty_flag,average_price,spender_flag,median_days_since_prior_order,frequency_flag
0,2539329,1,1,2,8,NaN,True,196,1,0,...,Regularly busy,Regularly busy,6am - 9am,Average orders,10,New customer,6.367797,Low Spender,20.5,Non-frequent customer
1,2398795,1,2,3,7,15.0,False,196,1,1,...,Regularly busy,Least busy,6am - 9am,Average orders,10,New customer,6.367797,Low Spender,20.5,Non-frequent customer
2,473747,1,3,3,12,21.0,False,196,1,1,...,Regularly busy,Least busy,10am - 13pm,Most orders,10,New customer,6.367797,Low Spender,20.5,Non-frequent customer
3,2254736,1,4,4,7,29.0,False,196,1,1,...,Least busy,Least busy,6am - 9am,Average orders,10,New customer,6.367797,Low Spender,20.5,Non-frequent customer
4,431534,1,5,4,15,28.0,False,196,1,1,...,Least busy,Least busy,14pm - 17pm,Average orders,10,New customer,6.367797,Low Spender,20.5,Non-frequent customer

In [15]:
df_customers.head()

,user_id,First Name,Surname,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [16]:
# Check data type of user_id columns

df_customers['user_id'].dtype

dtype('int64')

In [17]:
ords_prods['user_id'].dtype

dtype('int64')

In [18]:
# Joining the data sets on the user_id column

df_ords_prods_customers = ords_prods.merge(df_customers, on = 'user_id', indicator = 'merge')

In [19]:
df_ords_prods_customers.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,...,First Name,Surname,Gender,STATE,Age,date_joined,n_dependants,fam_status,income,merge
0,2539329,1,1,2,8,NaN,True,196,1,0,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2398795,1,2,3,7,15.0,False,196,1,1,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,473747,1,3,3,12,21.0,False,196,1,1,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2254736,1,4,4,7,29.0,False,196,1,1,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,431534,1,5,4,15,28.0,False,196,1,1,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [20]:
df_ords_prods_customers.shape

(32404859, 37)

In [ ]:
# check for full match using outer merge 

df_outer = ords_prods.merge(df_customers, on = 'user_id', indicator = 'merge_2', how = 'outer')

In [ ]:
df_outer['merge_2'].value_counts()

In [ ]:
df_ords_prods_customers.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'df_ords_prods_customers.pkl'))